{
  "recipes": [
    {
      "title": "Ham Sandwitch",
      "listIngredients": [
        "Bread",
        "Ham",
        "butter",
        "cheese"
      ],
      "method": "Cut the bread, put butter on bread, put ham & cheese",
      "time": "5",
      "description": "A simple sandwitch",
      "id": 1
    },
    {
      "title": "Spaghetti and Meatballs",
      "listIngredients": [
        "1 pound spaghetti",
        "1 pound ground beef"
      ],
      "method": "1. In a large pot, bring salted water to a boil. Cook spaghetti according to package instructions.\n\n2. In a large bowl, mix together ground beef, breadcrumbs, egg, garlic, salt, pepper, and parsley. Roll mixture into meatballs.",
      "time": "20",
      "description": "A classic Italian dish that's sure to satisfy",
      "id": 2
    },
    {
      "title": "Spicy Shrimp Linguine",
      "listIngredients": [
        "8 ounces linguine",
        "1 pound large shrimp, peeled and deveined",
        "2 tablespoons olive oil",
        "1 small onion, chopped",
        "3 cloves garlic, minced",
        "1/2 teaspoon red pepper flakes",
        "1 can (14.5 ounces) diced tomatoes",
        "1/4 cup chicken broth",
        "Salt and pepper, to taste",
        "Fresh parsley, chopped (for garnish)"
      ],
      "method": "Cook the linguine according to the package directions. Drain and set aside.\nIn a large skillet, heat the olive oil over medium-high heat. Add the onion and cook until softened, about 5 minutes.\nAdd the garlic and red pepper flakes and cook for another minute, until fragrant.\nAdd the diced tomatoes (with their juice) and chicken broth to the skillet. Bring to a simmer and cook for about 5 minutes.\nAdd the shrimp to the skillet and cook until they are pink and cooked through, about 3-5 minutes.\nSeason the sauce with salt and pepper to taste.\nAdd the cooked linguine to the skillet and toss until coated in the sauce.\nServe the spicy shrimp linguine in bowls, garnished with fresh parsley.",
      "time": "30",
      "description": "This spicy shrimp linguine is a quick and easy pasta dish that's perfect for a weeknight dinner. The tender shrimp are coated in a spicy tomato sauce and tossed with linguine for a delicious and satisfying meal.",
      "id": 3
    },
    {
      "title": "Test recipe",
      "listIngredients": [
        "salt pepper and anger",
        "dhdh",
        "djf"
      ],
      "method": "slow cook",
      "time": "420",
      "description": "Test recipe to test Redux",
      "id": 4
    }
  ]
}